//------------------------------
//-----------矩阵变量------------
//------------------------------

uint8_t row[] = { 11, 3, 2, 30, 4, 12, 6 };  //矩阵行针脚定义
const uint8_t rowCount = sizeof(row) / sizeof(row[0]);  //行总数

uint8_t col[] = { 7, A0, 13, 5, 10, 9, 8 };  //矩阵列针脚定义
const uint8_t colCount = sizeof(col) / sizeof(col[0]);  //列总数

//-------------------------------
//-----------矩阵描述------------
//-------------------------------

const uint8_t buttonNumber[rowCount][colCount] =  //矩阵中按钮编号定义
{
  {22, 0, 10, 11, 12, 13, 14},     //行 1
  {26, 27, 29, 25, 28, 0, 24},  //行 2
  {32, 31, 6, 0, 34, 18, 0},    //行 3
  {20, 0, 0, 1, 3, 4, 5},     //行 4
  {39, 41, 65, 0, 40, 0, 38},   //行 5
  {16, 0, 35, 33, 0, 0, 15},    //行 6
  {2, 37, 36 ,67 , 0, 0, 0}    //行 7
};

//-------------------------------
//---------模拟输入描述-----------
//-------------------------------

const uint8_t analogButtonNumber[4] =         //模拟输入编号矩阵 1
{ 69, 83, 0, 0 };

const uint8_t analogButtonNumberIncMode[4] =  //模拟输入编号矩阵 2（增量模式）
{ 81, 95, 0, 0 };

